Revit 2027 API
FieldBuilder.NeedsUnits Method
 Checks whether the field type requires explicit unit conversions.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool NeedsUnits()
Public Function NeedsUnits As Boolean
public:
bool NeedsUnits()
member NeedsUnits : unit -> bool
Return Value
Boolean
 True if units are required.
See Also
Reference
FieldBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace